[
  {
    "title": "Senior Data Scientist",
    "company": "Royal Cyber Inc., Islamabad, Pakistan",
    "period": "12/2023 – Present",
    "logo": "logos/royalcyberLogo.jpg",
    "projects": [
      {
        "name": "Vehicle Routing Optimization Platform (Niagara Bottling, US)",
        "desc": [
          "Engineered a large-scale optimization system; reduced solve time from 60 minutes to under 5 minutes for 100+ orders.",
          "Rebuilt routing engine with Python and Gurobi Cloud; enabled daily re-runs and automated reporting.",
          "Delivered secure CI/CD with Azure DevOps and MuleSoft integration for fully automated optimization.",
          "Achieved ~15% logistics cost savings via vehicle utilization and flexible-quantity handling.",
          "Recognized for replacing legacy AMPL/Oracle with a flexible production-grade solution."
        ],
        "tech": "Python, Gurobi, Pandas, Azure DevOps, Oracle DB, Docker, Kubernetes"
      },
      {
        "name": "Salesforce GenAI Email & Sentiment Automation (Internal)",
        "desc": [
          "Built an enterprise LLM platform for email generation and sentiment analysis with strict privacy controls.",
          "Implemented prompt masking/unmasking and GDPR-aligned trust boundaries; real-time APIs via FastAPI.",
          "Benchmarked LLaMA 3 and PHI-3; reduced LLM costs by up to 65% vs Einstein GPT.",
          "Delivered CI/CD for model updates, monitoring, and scalable deployment on Azure Container Apps."
        ],
        "tech": "Python, LLaMA 3, PHI-3, HuggingFace, LangChain, LlamaIndex, FastAPI, Azure Container Apps, MLflow"
      },
      {
        "name": "AI-Powered Document Receiving & Processing",
        "desc": [
          "Automated extraction of structured data from invoices/POs/shipping docs using OCR + transformer NLP.",
          "Built LangChain RAG pipelines for document classification and routing; cut manual work by ~80%.",
          "Deployed on Databricks + Airflow with ERP integrations and feature store for continuous improvement."
        ],
        "tech": "Python, HuggingFace, OCR, LangChain, LlamaIndex, Airflow, Databricks, Spark, AWS S3"
      },
      {
        "name": "Cart Abandonment Prediction & Segmentation (Omega Engineering)",
        "desc": [
          "Developed ML pipelines on multi-year behavioral data; achieved ~92% accuracy (F1=0.92).",
          "Created 9 actionable segments integrated into Salesforce Data Cloud for personalized campaigns.",
          "Tracked with MLflow and visualized impact via Tableau/Power BI for A/B testing."
        ],
        "tech": "Python, scikit-learn, XGBoost, LightGBM, CatBoost, SMOTE, Salesforce Data Cloud, MLflow, Tableau, Power BI"
      }
    ]
  },
  {
    "title": "Lead Data Scientist (Data Manager)",
    "company": "University of Chicago — IRD Global, Karachi, Pakistan",
    "period": "05/2022 – 11/2023",
    "logo": "logos/uchicagoLogo.png",
    "projects": [
      {
        "name": "Vaccination Timeliness Prediction",
        "desc": [
          "Built predictive models on 2.6M+ events; 87% accuracy and 98% recall for critical vaccines.",
          "Addressed severe class imbalance with SMOTE; integrated into the Azm mobile app for frontline use.",
          "Enabled prioritization across 12 districts and operationalized a sustainable MLOps pipeline."
        ],
        "tech": "Python, XGBoost, LightGBM, CatBoost, Logistic Regression, SMOTE, MLflow, Airflow"
      },
      {
        "name": "Digital Health Data Platform & Real-Time Analytics",
        "desc": [
          "Deployed cloud platform processing 1K+ records/day from 200+ field workers with robust ETL.",
          "Built workflows on AWS S3 + Airflow + dbt; delivered real-time dashboards for coverage and KPIs.",
          "Improved reliability with Kafka streaming and completeness monitoring."
        ],
        "tech": "Python, Airflow, dbt, SQL, AWS S3, Kafka, Tableau, Power BI"
      }
    ]
  },
  {
    "title": "Senior Data Scientist",
    "company": "Federation of Pakistan Chambers of Commerce & Industry (FPCCI), Pakistan",
    "period": "07/2021 – 05/2022",
    "logo": "logos/fpcciLogo.jpg",
    "projects": [
      {
        "name": "Gravity Model for Exports",
        "desc": [
          "Estimated untapped $1.07B in horticulture exports using PPML gravity modeling.",
          "Identified high-potential markets and product categories to inform cold-chain investments."
        ],
        "tech": "Python, Trade Map, FAO, IMF, World Bank"
      }
    ]
  },
  {
    "title": "Data Scientist",
    "company": "Love for Data, Karachi, Pakistan",
    "period": "10/2020 – 07/2021",
    "logo": "logos/lovefordataLogo.png",
    "projects": [
      {
        "name": "Loan Default Prediction",
        "desc": [
          "Engineered 20+ features; trained ML models to 92% ROC-AUC; reduced defaults by ~18%.",
          "Integrated model into loan decisioning API; cut underwriting time by ~60%."
        ],
        "tech": "Python, scikit-learn, XGBoost, SQL, REST API"
      }
    ]
  },
  {
    "title": "Data Scientist",
    "company": "Kashet Microfinance (Egypt)",
    "period": "2020 – 2021",
    "logo": "logos/kashetLogo.png",
    "projects": [
      {
        "name": "Real-Time Risk Scoring Platform",
        "desc": [
          "Developed scoring models on 50K+ loan records; reached 92% ROC-AUC; reduced defaults by 18%.",
          "Containerized services with Docker and tracked experiments with MLflow; prepared for SageMaker scale."
        ],
        "tech": "Python, SQL, XGBoost, Random Forest, CatBoost, REST APIs, Docker, MLflow, AWS SageMaker"
      }
    ]
  }
]
